IRP/src/InformationRegisters/MessagesQueueToSend/MessagesQueueToSend.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>MessagesQueueToSend</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Sent</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DateSent</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>NumberAttempts</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Message</name>
    <type>
      <types>DocumentRef.OutgoingMessage</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/MessagesQueueToSend/ManagerModule.bsl
// @strict-types

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

Procedure SendMessagesFromQueue() Export
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	MessagesQueueToSend.Period,
	|	MessagesQueueToSend.Message,
	|	MessagesQueueToSend.NumberAttempts
	|FROM
	|	InformationRegister.MessagesQueueToSend AS MessagesQueueToSend
	|WHERE
	|	NOT MessagesQueueToSend.Sent
	|	AND MessagesQueueToSend.NumberAttempts < &NumberAllowedAttempts";
	
	Query.SetParameter("NumberAllowedAttempts", 10);
	
	QuerySelection = Query.Execute().Select();
	
	//@skip-check property-return-type, statement-type-change
	While QuerySelection.Next() Do
		
		RecordManager = InformationRegisters.MessagesQueueToSend.CreateRecordManager();
		RecordManager.Period = QuerySelection.Period;
		RecordManager.Message = QuerySelection.Message;
		RecordManager.NumberAttempts = RecordManager.NumberAttempts + 1;
		
		Try
			//@skip-check invocation-parameter-type-intersect
			Documents.OutgoingMessage.SendMessage(QuerySelection.Message);
			RecordManager.DateSent = CommonFunctionsServer.GetCurrentSessionDate();
			RecordManager.Sent = True;
		Except
			Log.Write("Send messages", ErrorDescription(), , , QuerySelection.Message);
		EndTry;
		
		RecordManager.Write();
	
	EndDo;
	
EndProcedure

#EndRegion

#EndIf
